ir_version: 3
producer_name: "skl2onnx"
producer_version: "1.10.3"
domain: "ai.onnx"
model_version: 0
doc_string: ""
graph {
  node {
    input: "X"
    output: "label"
    output: "SVM02"
    name: "SVMc"
    op_type: "SVMClassifier"
    attribute {
      name: "classlabels_ints"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "coefficients"
      floats: 1.0
      floats: 0.4600808024406433
      floats: 0.8752110600471497
      floats: 1.0
      floats: 1.0
      floats: 1.0
      floats: 1.0
      floats: -0.4761848747730255
      floats: -1.0
      floats: -1.0
      floats: -1.0
      floats: -1.0
      floats: -1.0
      floats: -0.8591069579124451
      type: FLOATS
    }
    attribute {
      name: "kernel_params"
      floats: 5.805517196655273
      floats: 0.0
      floats: 3.0
      type: FLOATS
    }
    attribute {
      name: "kernel_type"
      s: "RBF"
      type: STRINGSVM02
    }
    attribute {
      name: "post_transform"
      s: "NONE"
      type: STRING
    }
    attribute {
      name: "rho"
      floats: -0.004232584498822689
      type: FLOATS
    }
    attribute {
      name: "support_vectors"
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.016336673870682716
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.02586563304066658
      floats: 0.054004423320293427
      floats: 0.01900605484843254
      floats: 0.0
      floats: 0.0
      floats: 0.01934230513870716
      floats: 0.0
      floats: 0.03455054759979248
      floats: 0.025704894214868546
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019174989312887192
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.02988697588443756
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0007391367107629776
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.02117200195789337
      floats: 0.0
      floats: 0.0
      floats: 0.00034045171923935413
      floats: 0.018441807478666306
      floats: 0.04474777728319168
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.002406216226518154
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00691803265362978
      floats: 0.03171516954898834
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.02670281007885933
      floats: 0.0
      floats: 0.00668280990794301
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0015917272539809346
      floats: 0.0
      floats: 0.0
      floats: 0.026581421494483948
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.050847895443439484
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01004102174192667
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019137613475322723
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.036883868277072906
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.014900757931172848
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0104370703920722
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.03841739892959595
      floats: 0.04469085484743118
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01203715056180954
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06686262041330338
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0330081582069397
      floats: 0.0
      floats: 0.016633853316307068
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018906187266111374
      floats: 0.0
      floats: 0.0
      floats: 0.00621808972209692
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.028153106570243835
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.033920127898454666
      floats: 0.026507338508963585
      floats: 0.0
      floats: 0.006483602337539196
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.020716171711683273
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0016643879935145378
      floats: 0.055453479290008545
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01741952821612358
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.014052847400307655
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.005162571556866169
      floats: 0.019293520599603653
      floats: 0.0
      floats: 0.0
      floats: 0.012556738220155239
      floats: 0.0
      floats: 0.0
      floats: 0.005663614254444838
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.010661574080586433
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0019868938252329826
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.05140174180269241
      floats: 0.0
      floats: 0.0009474828839302063
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00250945333391428
      floats: 0.018872424960136414
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.010815057903528214
      floats: 0.0
      floats: 0.0
      floats: 0.01571877859532833
      floats: 0.0
      floats: 0.0
      floats: 0.002189025515690446
      floats: 0.0
      floats: 0.0
      floats: 0.005479695741087198
      floats: 0.03201136365532875
      floats: 0.0
      floats: 0.020627319812774658
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.021385911852121353
      floats: 0.0
      floats: 0.018776370212435722
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.008556975051760674
      floats: 0.0
      floats: 0.02602500654757023
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.002618832513689995
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018749170005321503
      floats: 0.013275554403662682
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.04728478193283081
      floats: 0.0
      floats: 0.01781011000275612
      floats: 0.0
      floats: 0.0
      floats: 0.016692329198122025
      floats: 0.0
      floats: 0.0
      floats: 0.02158002182841301
      floats: 0.0
      floats: 0.019831717014312744
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0046927109360694885
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.022251002490520477
      floats: 0.0
      floats: 0.03994818776845932
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01830301061272621
      floats: 0.0
      floats: 0.0
      floats: 0.012599808163940907
      floats: 0.0
      floats: 0.03037228249013424
      floats: 0.0
      floats: 0.029184240847826004
      floats: 0.0
      floats: 0.04363211989402771
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.010984513908624649
      floats: 0.0
      floats: 0.008700765669345856
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.009205883368849754
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018955469131469727
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.030245311558246613
      floats: 0.005321723408997059
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00271034287288785
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01670093461871147
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0007360501913353801
      floats: 0.017698969691991806
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.020762478932738304
      floats: 0.010797890834510326
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01985880546271801
      floats: 0.01575637049973011
      floats: 0.01166526135057211
      floats: 0.023898359388113022
      floats: 0.01629219576716423
      floats: 0.0
      floats: 0.010055262595415115
      floats: 0.0
      floats: 0.0
      floats: 0.01382784266024828
      floats: 0.0
      floats: 0.01743459701538086
      floats: 0.0
      floats: 0.004827374592423439
      floats: 0.00859355553984642
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.008780752308666706
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.023210488259792328
      floats: 0.020723294466733932
      floats: 0.01205260306596756
      floats: 0.03303350508213043
      floats: 0.01733715645968914
      floats: 0.005645462777465582
      floats: 0.022477811202406883
      floats: 0.0
      floats: 0.019538991153240204
      floats: 0.0119973449036479
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.009384377859532833
      floats: 0.0
      floats: 0.0
      floats: 0.0040404521860182285
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019081130623817444
      floats: 0.008809116668999195
      floats: 0.009685532189905643
      floats: 0.0
      floats: 0.0
      floats: 0.020186077803373337
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.017914842814207077
      floats: 0.010809265077114105
      floats: 0.018912743777036667
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.02130552940070629
      floats: 0.0
      floats: 0.017263172194361687
      floats: 0.0
      floats: 0.013813840225338936
      floats: 0.013527808710932732
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018599117174744606
      floats: 0.0
      floats: 0.0
      floats: 0.022677814587950706
      floats: 0.0
      floats: 0.012167245149612427
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01260475441813469
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.023089349269866943
      floats: 0.0
      floats: 0.013029169291257858
      floats: 0.0
      floats: 0.0
      floats: 0.020923882722854614
      floats: 0.020062094554305077
      floats: 0.021913304924964905
      floats: 0.0
      floats: 0.013810055330395699
      floats: 0.0
      floats: 0.007898622192442417
      floats: 0.018317297101020813
      floats: 0.0
      floats: 0.010720359161496162
      floats: 0.007769156247377396
      floats: 0.0
      floats: 0.0
      floats: 0.004613128025084734
      floats: 0.0
      floats: 0.015879498794674873
      floats: 0.016288377344608307
      floats: 0.0
      floats: 0.0
      floats: 0.02331240475177765
      floats: 0.0
      floats: 0.0
      floats: 0.022874627262353897
      floats: 0.0
      floats: 0.009833503514528275
      floats: 0.0
      floats: 0.0
      floats: 0.009309768676757812
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.005953441374003887
      floats: 0.0
      floats: 0.0
      floats: 0.009002560749650002
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.016706565394997597
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01687825657427311
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01047542691230774
      floats: 0.0
      floats: 0.019500015303492546
      floats: 0.0
      floats: 0.01419348269701004
      floats: 0.013017820194363594
      floats: 0.022981341928243637
      floats: 0.0
      floats: 0.019716709852218628
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018154209479689598
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.005298050586134195
      floats: 0.0
      floats: 0.0
      floats: 0.016814498230814934
      floats: 0.002752100583165884
      floats: 0.01527718547731638
      floats: 0.00021519651636481285
      floats: 0.0
      floats: 0.015838030725717545
      floats: 0.01707301288843155
      floats: 0.014459657482802868
      floats: 0.0
      floats: 0.011999480426311493
      floats: 0.0
      floats: 0.021450776606798172
      floats: 0.016611432656645775
      floats: 0.0
      floats: 0.0
      floats: 0.020571758970618248
      floats: 0.009690356440842152
      floats: 0.013967240229249
      floats: 0.02103603631258011
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.006605790928006172
      floats: 0.01951519027352333
      floats: 0.011378219351172447
      floats: 0.010304699651896954
      floats: 0.0
      floats: 0.007220090366899967
      floats: 0.02367784082889557
      floats: 0.0
      floats: 0.0
      floats: 0.011373640969395638
      floats: 0.013626910746097565
      floats: 0.016709070652723312
      floats: 0.01787286438047886
      floats: 0.02585020288825035
      floats: 0.015046566724777222
      floats: 0.0
      floats: 0.0
      floats: 0.020721230655908585
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.009446170181035995
      floats: 0.0
      floats: 0.0
      floats: 0.01967710256576538
      floats: 0.0
      floats: 0.0
      floats: 0.017967665567994118
      floats: 0.009793391451239586
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.006300325505435467
      floats: 0.0
      floats: 0.0
      floats: 0.019759811460971832
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.024579666554927826
      floats: 0.02614769898355007
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019314806908369064
      floats: 0.021472878754138947
      floats: 0.008145212195813656
      floats: 0.0
      floats: 0.0
      floats: 0.011879694648087025
      floats: 0.0
      floats: 0.017971742898225784
      floats: 0.023845143616199493
      floats: 0.0
      floats: 0.02050682157278061
      floats: 0.0
      floats: 0.015057936310768127
      floats: 0.0
      floats: 0.016361502930521965
      floats: 0.0
      floats: 0.025632036849856377
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.012825467623770237
      floats: 0.0
      floats: 0.018156995996832848
      floats: 0.018407344818115234
      floats: 0.0
      floats: 0.0
      floats: 0.023456644266843796
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.015377737581729889
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.02215278521180153
      floats: 0.0
      floats: 0.0
      floats: 0.013187512755393982
      floats: 0.021840032190084457
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018136028200387955
      floats: 0.011778684332966805
      floats: 0.013382380828261375
      floats: 0.0
      floats: 0.013278907164931297
      floats: 0.0
      floats: 0.0
      floats: 0.015849467366933823
      floats: 0.01944154128432274
      floats: 0.027556397020816803
      floats: 0.014866748824715614
      floats: 0.0
      floats: 0.0
      floats: 0.0152110131457448
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.007340654730796814
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01756799966096878
      floats: 0.01966318115592003
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018484000116586685
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019132869318127632
      floats: 0.0
      floats: 0.014068455435335636
      floats: 0.022258656099438667
      floats: 0.0
      floats: 0.012402092106640339
      floats: 0.0
      floats: 0.008036493323743343
      floats: 0.0
      floats: 0.0
      floats: 0.01306266151368618
      floats: 0.015962908044457436
      floats: 0.0
      floats: 0.011423862539231777
      floats: 0.0
      floats: 0.0
      floats: 0.026661159470677376
      floats: 0.009182109497487545
      floats: 0.02277042716741562
      floats: 0.02133244276046753
      floats: 0.01198634598404169
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.025796648114919662
      floats: 0.0
      floats: 0.010314256884157658
      floats: 0.013798724859952927
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.010720659047365189
      floats: 0.0
      floats: 0.015605094842612743
      floats: 0.0
      floats: 0.0
      floats: 0.013300417922437191
      floats: 0.017583854496479034
      floats: 0.015241609886288643
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01578305847942829
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00045335222966969013
      floats: 0.0
      floats: 0.010993611998856068
      floats: 0.0
      floats: 0.014569014310836792
      floats: 0.0
      floats: 0.008128163404762745
      floats: 0.0
      floats: 0.01767110824584961
      floats: 0.018273700028657913
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.023830313235521317
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.012729139998555183
      floats: 0.013494017533957958
      floats: 0.01710059866309166
      floats: 0.0
      floats: 0.013265212997794151
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.012730012647807598
      floats: 0.0
      floats: 0.01786821335554123
      floats: 0.0
      floats: 0.0
      floats: 0.021789783611893654
      floats: 0.0
      floats: 0.0
      floats: 0.007062498480081558
      floats: 0.013073463924229145
      floats: 0.021023623645305634
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0046058837324380875
      floats: 0.0
      floats: 0.006869122385978699
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019679466262459755
      floats: 0.005132250487804413
      floats: 0.0
      floats: 0.0
      floats: 0.014511898159980774
      floats: 0.017878104001283646
      floats: 0.017265398055315018
      floats: 0.02164977788925171
      floats: 0.01638004556298256
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.018820745870471
      floats: 0.00712216179817915
      floats: 0.024132024496793747
      floats: 0.0030400296673178673
      floats: 0.020220087841153145
      floats: 0.0
      floats: 0.0
      floats: 0.010576817207038403
      floats: 0.011451433412730694
      floats: 0.020281584933400154
      floats: 0.019435517489910126
      floats: 0.0
      floats: 0.0
      floats: 0.021202534437179565
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.017130430787801743
      floats: 0.013132400810718536
      floats: 0.0
      floats: 0.01343268807977438
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01918647438287735
      floats: 0.010228617116808891
      floats: 0.014478071592748165
      floats: 0.0
      floats: 0.016246680170297623
      floats: 0.0
      floats: 0.017857342958450317
      floats: 0.0
      floats: 0.0
      floats: 0.0150116216391325
      floats: 0.0
      floats: 0.0180023405700922
      floats: 0.0
      floats: 0.010180381126701832
      floats: 0.0
      floats: 0.0
      floats: 0.017733827233314514
      floats: 0.0
      floats: 0.0043904599733650684
      floats: 0.015844695270061493
      floats: 0.0
      floats: 0.01396219152957201
      floats: 0.013275930657982826
      floats: 0.017687171697616577
      floats: 0.0
      floats: 0.0
      floats: 0.016337696462869644
      floats: 0.02661845274269581
      floats: 0.0
      floats: 0.0
      floats: 0.00540465721860528
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07065971195697784
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.050300177186727524
      floats: 0.06690239161252975
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.08663446456193924
      floats: 0.06579989194869995
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.082182377576828
      floats: 0.03664769232273102
      floats: 0.0
      floats: 0.09173043072223663
      floats: 0.07095777988433838
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06184588372707367
      floats: 0.0
      floats: 0.0688825398683548
      floats: 0.0
      floats: 0.05327934771776199
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07826853543519974
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.08595743030309677
      floats: 0.0
      floats: 0.056062933057546616
      floats: 0.10114017128944397
      floats: 0.06291748583316803
      floats: 0.0
      floats: 0.07299663871526718
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07733334600925446
      floats: 0.06367829442024231
      floats: 0.0708494782447815
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07271885126829147
      floats: 0.06572506576776505
      floats: 0.07329482585191727
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.09109191596508026
      floats: 0.0
      floats: 0.07194612920284271
      floats: 0.0
      floats: 0.0934629738330841
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.09575797617435455
      floats: 0.0
      floats: 0.0
      floats: 0.07488615810871124
      floats: 0.0
      floats: 0.06521289050579071
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.058101944625377655
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07377883046865463
      floats: 0.0
      floats: 0.06511425226926804
      floats: 0.0
      floats: 0.0
      floats: 0.09542347490787506
      floats: 0.06766960024833679
      floats: 0.0
      floats: 0.0
      floats: 0.08338803797960281
      floats: 0.0
      floats: 0.046640243381261826
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07375377416610718
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06652037054300308
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06877429783344269
      floats: 0.0
      floats: 0.0
      floats: 0.02541545405983925
      floats: 0.0
      floats: 0.05372297763824463
      floats: 0.0
      floats: 0.0
      floats: 0.028208013623952866
      floats: 0.0
      floats: 0.0
      floats: 0.017386246472597122
      floats: 0.009012996219098568
      floats: 0.0
      floats: 0.0
      floats: 0.05851444602012634
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07341257482767105
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06205739080905914
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.08667473495006561
      floats: 0.0
      floats: 0.07899965345859528
      floats: 0.07633525878190994
      floats: 0.09508651494979858
      floats: 0.0
      floats: 0.08072210848331451
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.08409693092107773
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06528721749782562
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.05849532037973404
      floats: 0.061708901077508926
      floats: 0.05496843904256821
      floats: 0.0
      floats: 0.07203599810600281
      floats: 0.0
      floats: 0.08665547519922256
      floats: 0.08727981150150299
      floats: 0.0
      floats: 0.0
      floats: 0.06115409731864929
      floats: 0.05891559273004532
      floats: 0.07080382108688354
      floats: 0.05394415929913521
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0741773247718811
      floats: 0.05240209028124809
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07864052802324295
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0668351799249649
      floats: 0.07681545615196228
      floats: 0.0
      floats: 0.08191387355327606
      floats: 0.07144765555858612
      floats: 0.0
      floats: 0.0
      floats: 0.08138477802276611
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07696238905191422
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.08249831944704056
      floats: 0.025752007961273193
      floats: 0.0
      floats: 0.0
      floats: 0.09759417921304703
      floats: 0.09382221102714539
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0755963996052742
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0723738744854927
      floats: 0.0
      floats: 0.08756202459335327
      floats: 0.09892063587903976
      floats: 0.0
      floats: 0.08281387388706207
      floats: 0.0
      floats: 0.07528679817914963
      floats: 0.0
      floats: 0.08506317436695099
      floats: 0.0
      floats: 0.059993255883455276
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07290982455015182
      floats: 0.0
      floats: 0.06898970901966095
      floats: 0.08848077058792114
      floats: 0.017149753868579865
      floats: 0.0
      floats: 0.06294220685958862
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.05839110165834427
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07555784285068512
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06750491261482239
      floats: 0.0
      floats: 0.0
      floats: 0.011961115524172783
      floats: 0.0
      floats: 0.072220079600811
      floats: 0.07281706482172012
      floats: 0.0687103345990181
      floats: 0.0
      floats: 0.07356531172990799
      floats: 0.0
      floats: 0.0
      floats: 0.07663382589817047
      floats: 0.06540947407484055
      floats: 0.10178154706954956
      floats: 0.045614778995513916
      floats: 0.0
      floats: 0.0
      floats: 0.07783818989992142
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07088486850261688
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0852806493639946
      floats: 0.06429066509008408
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06382177770137787
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0020487881265580654
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07193665206432343
      floats: 0.0
      floats: 0.07412442564964294
      floats: 0.09436742961406708
      floats: 0.0
      floats: 0.06926136463880539
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06966346502304077
      floats: 0.0
      floats: 0.06046897917985916
      floats: 0.0
      floats: 0.0
      floats: 0.06854958832263947
      floats: 0.0
      floats: 0.0889437198638916
      floats: 0.07797849178314209
      floats: 0.032589077949523926
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.09057601541280746
      floats: 0.0
      floats: 0.0
      floats: 0.06426797807216644
      floats: 0.0
      floats: 0.0
      floats: 3.174133598804474e-05
      floats: 0.0
      floats: 0.0
      floats: 0.06158632040023804
      floats: 0.0
      floats: 0.04825635999441147
      floats: 0.0
      floats: 0.0
      floats: 0.06043202430009842
      floats: 0.07235787063837051
      floats: 0.07138378173112869
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07897578924894333
      floats: 0.0
      floats: 0.0015441924333572388
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06451001763343811
      floats: 0.0
      floats: 0.06949815899133682
      floats: 0.0
      floats: 0.0800916850566864
      floats: 0.086368627846241
      floats: 0.0
      floats: 0.0
      floats: 0.004600572399795055
      floats: 0.08573068678379059
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07575806975364685
      floats: 0.0
      floats: 0.03355228528380394
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019408347085118294
      floats: 0.0
      floats: 0.09008520096540451
      floats: 0.0
      floats: 0.0
      floats: 0.0781402513384819
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06856761872768402
      floats: 0.09136199206113815
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0686255618929863
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06491737812757492
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.07243062555789948
      floats: 0.0
      floats: 0.0847853571176529
      floats: 0.07585827261209488
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.08023334294557571
      floats: 0.060718756169080734
      floats: 0.10507017374038696
      floats: 0.0
      floats: 0.07255486398935318
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06933161616325378
      floats: 0.0
      floats: 0.0810277909040451
      floats: 0.0
      floats: 0.0
      floats: 0.062059152871370316
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.06106322631239891
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.05977632477879524
      floats: 0.06610596179962158
      floats: 0.05767005681991577
      floats: 0.0
      floats: 0.08462639153003693
      floats: 0.0
      floats: 0.0798332691192627
      floats: 0.0
      floats: 0.0
      floats: 0.06549658626317978
      floats: 0.0
      floats: 0.08101902902126312
      floats: 0.0
      floats: 0.0665644034743309
      floats: 0.0
      floats: 0.0
      floats: 0.080964095890522
      floats: 0.0
      floats: 0.0
      floats: 0.08772067725658417
      floats: 0.0
      floats: 0.07646536827087402
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0036218855530023575
      floats: 0.08172032237052917
      floats: 0.07213003933429718
      floats: 0.0
      floats: 0.0
      floats: 0.05935477465391159
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0067449901252985
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.005772015545517206
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01046973466873169
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0123972799628973
      floats: 0.0005949526093900204
      floats: 0.007694028317928314
      floats: 0.0
      floats: 0.01948876678943634
      floats: 0.0
      floats: 0.0
      floats: 6.681308150291443e-05
      floats: 0.0
      floats: 0.007422879338264465
      floats: 0.0
      floats: 0.0
      floats: 0.005057029891759157
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.006105409003794193
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.021064240485429764
      floats: 0.02115459181368351
      floats: 0.010683647356927395
      floats: 0.0
      floats: 0.0
      floats: 0.01904195360839367
      floats: 0.0
      floats: 0.030760519206523895
      floats: 0.017909038811922073
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.021760761737823486
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.005064607597887516
      floats: 0.0
      floats: 0.010845164768397808
      floats: 0.0
      floats: 0.0
      floats: 0.022456243634223938
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.002082598162814975
      floats: 0.014113838784396648
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.021225742995738983
      floats: 0.0
      floats: 0.01236856821924448
      floats: 0.0
      floats: 0.02844858542084694
      floats: 0.024064278230071068
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.015488897450268269
      floats: 0.0
      floats: 0.0
      floats: 0.003510003676638007
      floats: 0.0
      floats: 0.005207456182688475
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.009553990326821804
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00211917981505394
      floats: 0.0
      floats: 0.009252313524484634
      floats: 0.0
      floats: 0.0
      floats: 0.013896887190639973
      floats: 0.0
      floats: 0.02127091772854328
      floats: 0.0
      floats: 0.01435803808271885
      floats: 0.0
      floats: 0.0
      floats: 0.012031913734972477
      floats: 0.0
      floats: 0.018066462129354477
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0163104310631752
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.02706393599510193
      floats: 0.0
      floats: 0.004391628783196211
      floats: 0.0
      floats: 0.0
      floats: 0.017278455197811127
      floats: 0.0
      floats: 0.010068116709589958
      floats: 0.0
      floats: 0.0030302219092845917
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0003571808338165283
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.019292393699288368
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.006104320753365755
      floats: 0.0
      floats: 0.01394020114094019
      floats: 0.0
      floats: 0.017724666744470596
      floats: 0.0
      floats: 0.005988997872918844
      floats: 0.0
      floats: 0.000647919368930161
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0057396735064685345
      floats: 0.0
      floats: 0.0
      floats: 0.010340912267565727
      floats: 0.013104586862027645
      floats: 0.023628195747733116
      floats: 0.0029311487451195717
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0029630251228809357
      floats: 0.021978091448545456
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.004940296523272991
      floats: 0.0025651806499809027
      floats: 0.025090772658586502
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.011985176242887974
      floats: 0.0
      floats: 0.0011249780654907227
      floats: 0.02966523915529251
      floats: 0.0
      floats: 0.0014114186633378267
      floats: 0.0008948128670454025
      floats: 0.0
      floats: 0.0
      floats: 0.02521446719765663
      floats: 0.0
      floats: 0.005894958041608334
      floats: 0.006502605974674225
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.007627767976373434
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.014359671622514725
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.027840014547109604
      floats: 0.011506209149956703
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0012200744822621346
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01640014536678791
      floats: 0.0004644980654120445
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.023573581129312515
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.006853794679045677
      floats: 0.0
      floats: 0.0
      floats: 0.01737409457564354
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.008007034659385681
      floats: 0.0
      floats: 0.02282574772834778
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00041088834404945374
      floats: 0.0
      floats: 0.0
      floats: 0.014501489698886871
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.013656427152454853
      floats: 0.001072147861123085
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.011373398825526237
      floats: 0.0
      floats: 0.0
      floats: 0.011882705613970757
      floats: 0.0
      floats: 0.0
      floats: 0.002383278449997306
      floats: 0.029237467795610428
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00867315474897623
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.00043966295197606087
      floats: 0.006587350741028786
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0009074724512174726
      floats: 0.0
      floats: 0.007461984176188707
      floats: 0.019536634907126427
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01631074585020542
      floats: 0.0
      floats: 0.0
      floats: 0.011940146796405315
      floats: 0.005441398825496435
      floats: 0.0
      floats: 0.012226828373968601
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.011714432388544083
      floats: 0.007539758458733559
      floats: 0.018727846443653107
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.017296619713306427
      floats: 0.0
      floats: 0.014836929738521576
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.012734806165099144
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0031678793020546436
      floats: 0.0
      floats: 0.027012478560209274
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.014513706788420677
      floats: 0.004940471146255732
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.012666091322898865
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.008061022497713566
      floats: 0.010747854597866535
      floats: 0.0018063621828332543
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.024716302752494812
      floats: 0.0
      floats: 0.02068846859037876
      floats: 0.0
      floats: 0.0
      floats: 0.014240389689803123
      floats: 0.0
      floats: 0.0
      floats: 0.017401689663529396
      floats: 0.006388053297996521
      floats: 0.020374666899442673
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01247137226164341
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.01106911152601242
      floats: 0.011420300230383873
      floats: 0.0
      floats: 0.013944007456302643
      floats: 0.007322125136852264
      floats: 0.02758593112230301
      floats: 0.0
      floats: 0.006528593599796295
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.012273572385311127
      floats: 0.005681237671524286
      floats: 0.008411730639636517
      floats: 0.018638916313648224
      floats: 0.0
      floats: 0.005603221245110035
      floats: 0.0
      floats: 0.019962890073657036
      floats: 0.0
      floats: 0.01786915957927704
      floats: 0.005490117706358433
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.020786795765161514
      floats: 0.0
      floats: 0.013264702633023262
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.015483126044273376
      floats: 0.015036807395517826
      floats: 0.014037168584764004
      floats: 0.0
      floats: 0.013843704015016556
      floats: 0.0
      floats: 0.009994545951485634
      floats: 0.0
      floats: 0.0
      floats: 0.02446453832089901
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0010779201984405518
      floats: 0.0
      floats: 0.0
      floats: 0.006350819021463394
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.021409951150417328
      floats: 0.016679132357239723
      floats: 0.0
      floats: 0.0
      floats: 0.0027786712162196636
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.007099979557096958
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.015317067503929138
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.003233145922422409
      floats: 0.004379970952868462
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.003476278157904744
      floats: 0.016999024897813797
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0041250502690672874
      floats: 0.0019767030607908964
      floats: 0.012605899944901466
      floats: 0.01310434378683567
      floats: 0.01112861093133688
      floats: 0.0
      floats: 0.015269050374627113
      floats: 0.0
      floats: 0.0
      floats: 0.005881971679627895
      floats: 0.0
      floats: 0.009690219536423683
      floats: 0.0
      floats: 0.0
      floats: 0.000807647593319416
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0020692949183285236
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.006417066790163517
      floats: 0.018762066960334778
      floats: 0.024145327508449554
      floats: 0.01944713480770588
      floats: 0.0
      floats: 0.0
      floats: 0.029072418808937073
      floats: 0.0
      floats: 0.027168262749910355
      floats: 0.02025444805622101
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.015142476186156273
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.0
      floats: 0.020006677135825157
      floats: 0.0010257228277623653
      floats: 0.011697841808199883
